<script setup lang="ts">
import { ref } from 'vue';
import { LegalView } from '@/ts/types/View';

const active = ref<LegalView>(LegalView.TermsOfService);
</script>
<template>
<main>
    <el-tabs v-model="active">
        <el-tab-pane label="Условия предоставления услуг (Terms of Service)" :name="LegalView.TermsOfService">
            <article>
                <h1>Условия предоставления услуг</h1>
                <h2>Соглашение с условиями использования маркетплейса TEWA</h2>
                <p>Нажимая кнопку «Зарегистрироваться» или начиная использование сервиса TEWA, вы (далее - «Пользователь») подтверждаете, что ознакомились, полностью согласны и обязуетесь соблюдать настоящее Соглашение. Если вы не согласны с каким-либо из условий, вы не имеете права использовать платформу TEWA.</p>
                <p><strong>1. Общие положения</strong></p>
                <p><strong>1.1.</strong> TEWA (Template E-commerce Web Application) — это программная платформа для создания и ведения онлайн-бизнеса, позволяющая Пользователям размещать товары и совершать сделки.</p>
                <p><strong>1.2.</strong> Используя платформу как продавец, Пользователь подтверждает свою дееспособность и право осуществлять коммерческую деятельность в соответствии с законодательством своей страны.</p>
                <p><strong>2. Коммерческое использование</strong></p>
                <p><strong>2.1.</strong> Платформа TEWA предоставляет Пользователям возможность использовать её функционал в коммерческих целях для продажи товаров и услуг.</p>
                <p><strong>2.2.</strong> Пользователь самостоятельно несёт ответственность за соблюдение налогового, таможенного и иного законодательства, применимого к его коммерческой деятельности.</p>
                <p><strong>3. Права на контент и лицензирование</strong></p>
                <p><strong>3.1. Гарантии Пользователя.</strong> Пользователь подтверждает и гарантирует, что обладает всеми необходимыми правами, включая авторские права и права на товарные знаки, на весь контент (фотографии, описания товаров, графические изображения и т.д.), который он загружает, публикует или иным образом распространяет через платформу TEWA.</p>
                <p><strong>3.2. Предоставление лицензии.</strong> Настоящим Пользователь предоставляет Владельцу платформы TEWA неисключительную, безвозмездную, сублицензируемую, всемирную лицензию на использование, воспроизведение, распространение, создание производных произведений, показ и исполнение загруженного контента <strong>исключительно в целях функционирования, продвижения и улучшения сервиса TEWA</strong>. К таким целям относятся, но не ограничиваются:</p>
                <ul>
                    <li>Отображение товаров в каталоге маркетплейса.</li>
                    <li>Использование в рекламных и маркетинговых материалах TEWA (например, в социальных сетях, рекламных баннерах, email-рассылках).</li>
                    <li>Техническая обработка и адаптация контента для корректного отображения на различных устройствах и в разных браузерах.</li>
                </ul>
                <p><strong>3.3. Отделение от лицензии AGPL</strong></p>
                <p><strong>3.3.1.</strong> Платформа TEWA как программное обеспечение распространяется под лицензией GNU Affero General Public License (AGPL).</p>
                <p><strong>3.3.2.</strong> Весь контент, загружаемый Пользователем, <strong>НЕ ЯВЛЯЕТСЯ</strong> частью программного кода TEWA и <strong>НЕ ПОДПАДАЕТ</strong> под условия лицензии AGPL.</p>
                <p><strong>3.3.3.</strong> Права на пользовательский контент регулируются исключительно настоящим Соглашением. Условия лицензии AGPL не предоставляют третьим лицам никаких прав на использование, копирование или распространение контента, созданного Пользователями.</p>
                <p><strong>4. Обработка персональных данных</strong></p>
                <p><strong>4.1.</strong> Регистрируясь на платформе, Пользователь даёт согласие Владельцу TEWA на сбор, хранение и обработку своих персональных данных, предоставленных при регистрации и в процессе использования сервиса, в целях выполнения условий настоящего Соглашения, обеспечения функционирования платформы, а также для связи с Пользователем.</p>
                <p><strong>4.2.</strong> Обработка персональных данных осуществляется в соответствии с действующим законодательством, включая, но не ограничиваясь, Общим регламентом по защите данных (GDPR) и Федеральным законом РФ № 152-ФЗ «О персональных данных».</p>
                <p><strong>5. Права платформы</strong></p>
                <p><strong>5.1.</strong> Владелец TEWA оставляет за собой право, по своему усмотрению и без предварительного уведомления, удалять или блокировать любой контент Пользователя, который, по мнению Владельца:</p>
                <ul>
                    <li>Нарушает авторские права, товарные знаки или иные права интеллектуальной собственности третьих лиц.</li>
                    <li>Является незаконным, мошенническим, клеветническим, оскорбительным или нарушает действующее законодательство.</li>
                    <li>Содержит спам или вредоносный код.</li>
                </ul>
                <p><strong>6. Применимое право и разрешение споров</strong></p>
                <p><strong>6.1.</strong> Настоящее Соглашение регулируется и толкуется в соответствии с законодательством Российской Федерации.</p>
                <p><strong>6.2.</strong> Все споры, вытекающие из настоящего Соглашения, подлежат разрешению в судебных органах по месту нахождения Владельца платформы TEWA, если иное не предусмотрено императивными нормами права.</p>
            </article>
        </el-tab-pane>
        <el-tab-pane label="Хранение персональный данных (Personal Data Policy)" :name="LegalView.PersonalDataPolicy">
            <h1>Политика обработки персональных данных</h1>
            <p>Вся информация хранится постоянно и удаляется немедленно после удаления аккаунта.</p>
            <h3>1.1. Все пользователи</h3>
            <table>
            <thead>
            <tr>
            <th>Данные</th>
            <th>Тип</th>
            <th>Цель сбора</th>
            <th>Шифрование</th>
            </tr>
            </thead>
            <tbody><tr>
            <td><strong>Обязательные</strong></td>
            <td></td>
            <td></td>
            <td></td>
            </tr>
            <tr>
            <td>Email</td>
            <td>string</td>
            <td>Аутентификация</td>
            <td>AES-256</td>
            </tr>
            <tr>
            <td>Имя</td>
            <td>string</td>
            <td>Оформление заказов, доставка</td>
            <td>-</td>
            </tr>
            <tr>
            <td>Пароль (hash)</td>
            <td>string</td>
            <td>Безопасность</td>
            <td>bcrypt</td>
            </tr>
            <tr>
            <td>Дата рождения</td>
            <td>date</td>
            <td>Персонализация, безопасность</td>
            <td>-</td>
            </tr>
            <tr>
            <td><strong>Опциональные</strong></td>
            <td></td>
            <td></td>
            <td></td>
            </tr>
            <tr>
            <td>Аватар</td>
            <td>file</td>
            <td>Профиль</td>
            <td>-</td>
            </tr>
            <tr>
            <td>Адреса доставки</td>
            <td>json</td>
            <td>Оформление заказов, доставка</td>
            <td>-</td>
            </tr>
            </tbody></table>
            <h3>1.2. Продавцы</h3>
            <table>
            <thead>
            <tr>
            <th>Данные</th>
            <th>Тип</th>
            <th>Цель</th>
            </tr>
            </thead>
            <tbody><tr>
            <td>ФИО</td>
            <td>string</td>
            <td>Выплаты, договор</td>
            </tr>
            <tr>
            <td>Реквизиты компании</td>
            <td>string</td>
            <td>Выплаты, договор</td>
            </tr>
            <tr>
            <td>ИНН/ОГРН</td>
            <td>string</td>
            <td>Проверка</td>
            </tr>
            <tr>
            <td>Паспортные данные</td>
            <td>string</td>
            <td>Верификация</td>
            </tr>
            <tr>
            <td>Банковские реквизиты</td>
            <td>string</td>
            <td>Выплаты</td>
            </tr>
            </tbody></table>
        </el-tab-pane>
    </el-tabs>
</main>
</template>
<style scoped>
main {
    background: var(--el-color-primary-light-9);
    border-radius: 1rem;
    padding: 1rem;
    padding-top: 0;
    margin: 1rem;
}
/* text */
h1 {
    font-size: 1.75rem;
    margin-top: 0;
}
p, ul {
    text-align: justify;
    line-height: 1.5;
    font-size: 1.05rem;
}
article:last-child p {
    margin-bottom: 0;
}
table {
    width: 100%;
    border-collapse: collapse;
    margin: 25px 0;
    border-radius: .5rem;
    overflow: hidden;
}
table, td, tr {
    border: 1px solid var(--el-border-color);
}
td {
    padding: .5rem;
}
</style>